var map = L.map('map', {
    center: [25.0326662, 121.4801454],
    zoom: 20
});


L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
    attribution: '&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors',
}).addTo(map);


// L.marker([25.0537071, 121.5917962]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10582290.html">辦公室權狀196坪出租方正格局</a><h1>176,400 元/月</h1><h1>坪數 :  196坪</h1>');
// L.marker([25.0553424, 121.5913981]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10314813.html">南港科技辦租金實惠時尚舒適辦公環境優!</a><h1>197,000 元/月</h1><h1>坪數 :  197坪</h1>');
// L.marker([25.0588380, 121.6047580]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10542942.html">企業東移南港科技辦方正簡約明亮環境優!</a><h1>152,381 元/月</h1><h1>坪數 :  108.7坪</h1>');
// L.marker([25.0588380, 121.6047580]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10279056.html">入主亞太雲端城市贏在起跑點台北第二世貿區</a><h1>432,276 元/月</h1><h1>坪數 :  360.23坪</h1>');
// L.marker([25.0501105, 121.5932604]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10625467.html">昆陽站尊榮辦視野唯美環境優現成裝潢超值選</a><h1>354,667 元/月</h1><h1>坪數 :  266坪</h1>');
// L.marker([25.0499523, 121.5777326]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10577232.html">四鐵共構松車文清藝術風時尚辦商圈機能優</a><h1>132,420 元/月</h1><h1>坪數 :  132坪</h1>');
// L.marker([25.0466213, 121.5836722]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10526536.html">頂級純辦公氣派大方後山埤站稀有把握機會!</a><h1>110,000 元/月</h1><h1>坪數 :  73.39坪</h1>');
// L.marker([25.0574659, 121.5914480]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10612033.html">廠辦大樓出租權狀212.08坪稀有物件</a><h1>196,000 元/月</h1><h1>坪數 :  212.08坪</h1>');
// L.marker([25.0531390, 121.5912440]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10612065.html">園區商圈漂亮辦公方正氣派大樓門廳</a><h1>197,000 元/月</h1><h1>坪數 :  197坪</h1>');
// L.marker([25.0552079, 121.5932725]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10383529.html">捷運高級商辦大樓約106坪稀有物件</a><h1>98,000 元/月</h1><h1>坪數 :  106坪</h1>');
// L.marker([25.0572540, 121.6018180]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10620865.html">氣派大樓、採光明亮、格局方正好規劃</a><h1>254,000 元/月</h1><h1>坪數 :  237坪</h1>');
// L.marker([25.0554960, 121.5928350]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10413267.html">戰勝不景氣!近昆陽站南港科技辦節流首選.</a><h1>295,000 元/月</h1><h1>坪數 :  228.19坪</h1>');
// L.marker([25.0585312, 121.6061037]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10271734.html">最優質企業總部交通便捷提升企業形象首選</a><h1>150,000 元/月</h1><h1>坪數 :  123.75坪</h1>');
// L.marker([25.0588747, 121.6137051]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10380624.html">南軟園區全新氣派樓近捷運火車站東移新選擇</a><h1>234,285 元/月</h1><h1>坪數 :  123坪</h1>');
// L.marker([25.0467642, 121.5826678]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10411989.html">北辦東移媲美信義商圈頂級辦門廳氣派機能讚</a><h1>110,000 元/月</h1><h1>坪數 :  73.39坪</h1>');
// L.marker([25.056135, 121.59055]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10454096.html">昆陽捷運站~面河景一層ㄧ戶~屋優~</a><h1>160,000 元/月</h1><h1>坪數 :  204.27坪</h1>');
// L.marker([25.0551690, 121.6151870]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10620359.html">南港展覽館站~挑高方正~屋況佳~</a><h1>100,000 元/月</h1><h1>坪數 :  79坪</h1>');
// L.marker([25.0560551, 121.5898749]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10579656.html">河岸景觀,門廳氣派,彩光棒.視野好</a><h1>100,000 元/月</h1><h1>坪數 :  84.81坪</h1>');
// L.marker([25.0551892, 121.5892360]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10621225.html">昆陽捷運站~視野好屋優~立即可用~</a><h1>100,000 元/月</h1><h1>坪數 :  84.81坪</h1>');
// L.marker([25.0516995, 121.5948494]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10622187.html">💲簡約裝潢即進駐近捷運💲專車接送看屋</a><h1>372,400 元/月</h1><h1>坪數 :  266坪</h1>');
// L.marker([25.0525582, 121.604518]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10285196.html">⭐免仲介費⭐南港車站*三鐵共構*氣派大樓</a><h1>3,492,525 元/月</h1><h1>坪數 :  1397.01坪</h1>');
// L.marker([25.0499523, 121.5777326]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10278064.html">◆宜家國際地產◆低公設/使用性佳/松山站</a><h1>139,041 元/月</h1><h1>坪數 :  132坪</h1>');
// L.marker([25.0547209, 121.5907766]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10509058.html">園區精美辦公室87519898低公設廠辦</a><h1>196,000 元/月</h1><h1>坪數 :  197坪</h1>');
// L.marker([25.0551690, 121.6151870]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10611984.html">近捷運辦公大樓，南港軟體園區附近，可分租</a><h1>100,000 元/月</h1><h1>坪數 :  79坪</h1>');
// L.marker([25.0568471, 121.6008550]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10454862.html">小房東*南港重陽*大空間商辦*誠可議</a><h1>145,000 元/月</h1><h1>坪數 :  135坪</h1>');
// L.marker([25.0501105, 121.5932604]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10616770.html">昆陽捷運辦公室</a><h1>372,400 元/月</h1><h1>坪數 :  266坪</h1>');
// L.marker([25.0568368, 121.6022232]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10477754.html">捷運南港站30至40人精美廠辦</a><h1>168,000 元/月</h1><h1>坪數 :  160坪</h1>');
// L.marker([25.0605957, 121.6113907]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10285599.html">南港軟體園區旁商辨</a><h1>100,000 元/月</h1><h1>坪數 :  88.2坪</h1>');
// L.marker([25.0543106, 121.6139236]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10613275.html">南港展館旁58坪店面</a><h1>100,000 元/月</h1><h1>坪數 :  58.49坪</h1>');
// L.marker([25.0579161, 121.6047674]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10617327.html">氣派門廳、格局方正挑高、採光好</a><h1>215,880 元/月</h1><h1>坪數 :  179坪</h1>');
// L.marker([25.0606174, 121.6165221]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-9891179.html">捷運景觀辦公一層一戶三面採光全新鋼骨大樓</a><h1>543,972 元/月</h1><h1>坪數 :  247.26坪</h1>');
// L.marker([25.0500665, 121.5922211]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10582436.html">公設低使用250坪有隔間裝潢請電余小姐</a><h1>372,400 元/月</h1><h1>坪數 :  266坪</h1>');
// L.marker([25.0574946, 121.6028810]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10536824.html">八米面寬方正店面🌟可做辦公🌟</a><h1>82,000 元/月</h1><h1>坪數 :  75.14坪</h1>');
// L.marker([25.0590212, 121.6138516]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10475641.html">✨南港全新精華優質商辦Ⅰ✨</a><h1>261,269 元/月</h1><h1>坪數 :  123.62坪</h1>');
// L.marker([25.0461156, 121.5817067]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10642188.html">★信義路五段象山站管理嚴謹玻璃帷幕景觀佳</a><h1>360,000 元/月</h1><h1>坪數 :  212.55坪</h1>');
// L.marker([25.0592358, 121.6151405]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-9870776.html">全新鋼骨A級商辦12~18地標景觀捷運旁</a><h1>3,981,300 元/月</h1><h1>坪數 :  1731坪</h1>');
// L.marker([25.0606141, 121.6154445]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10401402.html">近南軟站~經貿聯合純辦~景觀優</a><h1>262,000 元/月</h1><h1>坪數 :  111.48坪</h1>');
// L.marker([25.0528120, 121.6147020]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10445118.html">近捷運正忠孝東路面寬辦公</a><h1>43,800 元/月</h1><h1>坪數 :  27坪</h1>');
// L.marker([25.0445572, 121.5821568]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10497331.html">後山埤站/獨立出入/優質店辦</a><h1>235,000 元/月</h1><h1>坪數 :  151坪</h1>');
// L.marker([25.0498269, 121.5796590]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10508398.html">松山車站/一層一戶/精美裝潢</a><h1>240,000 元/月</h1><h1>坪數 :  199坪</h1>');
// L.marker([25.0614384, 121.6128123]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10616191.html">[風雲地產]-近南軟大空間優質辦公室</a><h1>32,000 元/月</h1><h1>坪數 :  34.02坪</h1>');
// L.marker([25.0512936, 121.5830755]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-9040017.html">松山火車站/高樓佰萬裝潢美辦/附冷氣另車</a><h1>58,000 元/月</h1><h1>坪數 :  51坪</h1>');
// L.marker([25.0495331, 121.5906769]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10395979.html">氣派大樓四面採光通風佳</a><h1>444,000 元/月</h1><h1>坪數 :  370坪</h1>');
// L.marker([25.0565111, 121.6014621]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10422813.html">@@南港捷運商圈旁*優質機能商辦</a><h1>40,000 元/月</h1><h1>坪數 :  46坪</h1>');
// L.marker([25.0444565, 121.5835173]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10622748.html">後山埤站2分鐘一樓住辦</a><h1>40,000 元/月</h1><h1>坪數 :  29.17坪</h1>');
// L.marker([25.0467642, 121.5826678]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10446333.html">★忠孝東路後山埤永春站純辦玻璃帷幕管理佳</a><h1>360,000 元/月</h1><h1>坪數 :  212.55坪</h1>');
// L.marker([25.0588380, 121.6047580]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10101018.html">全新落成南港區南港站A級商辦企業首選</a><h1>160,000 元/月</h1><h1>坪數 :  54.18坪</h1>');
// L.marker([25.0572517, 121.6034866]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10395044.html">Neoone全新氣派未來式A級商辦辦公</a><h1>210,000 元/月</h1><h1>坪數 :  140坪</h1>');
// L.marker([25.0598532, 121.6157579]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10434352.html">聯合經貿廣場😄永固安家</a><h1>4,260,000 元/月</h1><h1>坪數 :  1854.3坪</h1>');
// L.marker([25.0598532, 121.6157579]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10434351.html">聯合經貿廣場😄永固安家</a><h1>568,000 元/月</h1><h1>坪數 :  247.24坪</h1>');
// L.marker([25.0598532, 121.6157579]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10434345.html">聯合經貿廣場😄永固安家</a><h1>284,000 元/月</h1><h1>坪數 :  123.62坪</h1>');
// L.marker([25.0572672, 121.6141377]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10580833.html">南港軟體園區優質美辦231</a><h1>371,024 元/月</h1><h1>坪數 :  231.89坪</h1>');
// L.marker([25.0456093, 121.6143284]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10637330.html">大面寬,門口可停車進出貨方便</a><h1>70,000 元/月</h1><h1>坪數 :  55坪</h1>');
// L.marker([25.0598532, 121.6157579]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10434345.html">聯合經貿廣場😄永固安家</a><h1>284,000 元/月</h1><h1>坪數 :  123.62坪</h1>');
// L.marker([25.0572672, 121.6141377]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10580833.html">南港軟體園區優質美辦231</a><h1>371,024 元/月</h1><h1>坪數 :  231.89坪</h1>');
// L.marker([25.0456093, 121.6143284]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10637330.html">大面寬,門口可停車進出貨方便</a><h1>70,000 元/月</h1><h1>坪數 :  55坪</h1>');
// L.marker([25.0456093, 121.6143284]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10637399.html">近中研院電梯雅靜辦公,優質環境,可住辦</a><h1>32,000 元/月</h1><h1>坪數 :  38.88坪</h1>');
// L.marker([25.0480960, 121.5844360]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10641252.html">辦公室分租!!!</a><h1>25,000 元/月</h1><h1>坪數 :  60坪</h1>');
// L.marker([25.0445880, 121.5821876]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10458035.html">後山埤站忠孝東路永吉路優質店辦人潮多</a><h1>235,000 元/月</h1><h1>坪數 :  108.32坪</h1>');
// L.marker([25.0512936, 121.5830755]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10576182.html">✵旺德美客✵松山車站✵松山國小✵高樓辦公</a><h1>58,000 元/月</h1><h1>坪數 :  50坪</h1>');
// L.marker([25.0544811, 121.6140218]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10332610.html">✵旺德美客▲市民大道▲南港展覽館▲大坪數</a><h1>200,000 元/月</h1><h1>坪數 :  100坪</h1>');
// L.marker([25.0530987, 121.6134415]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10264405.html">南港工業辦公室</a><h1>25,000 元/月</h1><h1>坪數 :  26坪</h1>');
// L.marker([25.0590443, 121.6138747]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10623306.html">全新交屋,南港指標商辦..3-3</a><h1>297,000 元/月</h1><h1>坪數 :  65.18坪</h1>');
// L.marker([25.0526150, 121.6048061]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10439983.html">[裕邸外商租屋]南港氣派帷幕純辦/新房源</a><h1>3,318,550 元/月</h1><h1>坪數 :  1327坪</h1>');
// L.marker([25.0509922, 121.6031833]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10439952.html">[裕邸外商租屋]南港企業帷幕純辦/新房源</a><h1>1,659,300 元/月</h1><h1>坪數 :  664坪</h1>');
// L.marker([25.0567142, 121.5910554]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10573260.html">一層兩戶附OA、高樓層河景景觀</a><h1>100,000 元/月</h1><h1>坪數 :  82坪</h1>');
// L.marker([25.0461781, 121.5837777]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10619476.html">後山埤站🧀醒目招牌獨立出入店辦公有陽台</a><h1>235,000 元/月</h1><h1>坪數 :  151坪</h1>');
// L.marker([25.0582620, 121.6133027]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10580273.html">南港軟體園區💯機能佳交通便利辦公</a><h1>371,024 元/月</h1><h1>坪數 :  231坪</h1>');
// L.marker([25.0459416, 121.5830828]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10613984.html">後山埤站永吉路玉成街✨四面採光辦公</a><h1>210,000 元/月</h1><h1>坪數 :  139坪</h1>');
// L.marker([25.0445930, 121.5821926]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10458928.html">後山埤站優質店辦人潮多，可招牌廣告效益大</a><h1>235,000 元/月</h1><h1>坪數 :  108坪</h1>');
// L.marker([25.0562867, 121.5901065]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10332563.html">河岸景觀6年新大樓漂亮裝潢即可進駐</a><h1>100,000 元/月</h1><h1>坪數 :  84坪</h1>');
// L.marker([25.0551892, 121.5892360]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10584880.html">河岸景觀漂亮裝潢美辦</a><h1>100,000 元/月</h1><h1>坪數 :  84坪</h1>');
// L.marker([25.0461781, 121.5837777]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10585663.html">鄰近後山埤站*人潮多*優質店辦</a><h1>235,000 元/月</h1><h1>坪數 :  151坪</h1>');
// L.marker([25.0504170, 121.5922450]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10598424.html">一層一戶/現有隔間屋況佳/近捷運</a><h1>444,000 元/月</h1><h1>坪數 :  370坪</h1>');
// L.marker([25.0464568, 121.5835077]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10515092.html">忠孝東路六段氣派純辦</a><h1>126,800 元/月</h1><h1>坪數 :  41.75坪</h1>');
// L.marker([25.0585312, 121.6061037]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10589187.html">南港站A級商辦87519898企業首選</a><h1>150,000 元/月</h1><h1>坪數 :  123.75坪</h1>');
// L.marker([25.0568727, 121.6022591]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10589067.html">格局方正好規劃875198998採光明亮</a><h1>254,000 元/月</h1><h1>坪數 :  237坪</h1>');
// L.marker([25.053507, 121.6140897]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10396867.html">南港展覽館站一樓門口可停車</a><h1>30,000 元/月</h1><h1>坪數 :  25.74坪</h1>');
// L.marker([25.0584283, 121.6038147]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10411668.html">★尋屋，利達服其勞~南港低公設厰辦大樓！</a><h1>254,000 元/月</h1><h1>坪數 :  141.57坪</h1>');
// L.marker([25.0576112, 121.6037607]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10397146.html">萬棟豪宅壹廠辦，南港稀少辦公~三鐵共構！</a><h1>168,000 元/月</h1><h1>坪數 :  89.73坪</h1>');
// L.marker([25.0464568, 121.5835077]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10546502.html">板南線景觀商辦-中信張小姐</a><h1>125,000 元/月</h1><h1>坪數 :  73.64坪</h1>');
// L.marker([25.0587988, 121.6136292]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10505020.html">經貿聯合廣場全新A級辦公室</a><h1>264,000 元/月</h1><h1>坪數 :  111.48坪</h1>');
// L.marker([25.0560325, 121.5898523]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10507329.html">河岸景觀6年新大樓漂亮裝潢即可進駐</a><h1>100,000 元/月</h1><h1>坪數 :  84坪</h1>');
// L.marker([25.0520791, 121.5811204]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10458314.html">捷運松山•饒河商圈•高樓河景•寬敞辦公</a><h1>58,000 元/月</h1><h1>坪數 :  50坪</h1>');
// L.marker([25.0556264, 121.6124969]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10579685.html">南港捷運帷幕美辦</a><h1>371,024 元/月</h1><h1>坪數 :  231.89坪</h1>');
// L.marker([25.0445982, 121.5817394]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10263099.html">(太平洋商仲團隊)後山埤捷運整層辦公</a><h1>210,000 元/月</h1><h1>坪數 :  139坪</h1>');
// L.marker([25.0447395, 121.5823391]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10506747.html">後山埤站優質店辦人潮多</a><h1>235,000 元/月</h1><h1>坪數 :  151坪</h1>');
// L.marker([25.0447755, 121.5823751]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10427830.html">專用獨立華美直達對外馬路的樓梯，可當店面</a><h1>235,000 元/月</h1><h1>坪數 :  151.3坪</h1>');
// L.marker([25.0547090, 121.5977190]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10585085.html">南港世貿財星三樓工作室</a><h1>50,000 元/月</h1><h1>坪數 :  72坪</h1>');
// L.marker([25.0587988, 121.6136292]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10230800.html">南港軟體園區旁辦公樓出租!一層兩戶</a><h1>500,000 元/月</h1><h1>坪數 :  247坪</h1>');
// L.marker([25.0588747, 121.6137051]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10519567.html">@南軟A辦近中國信託氣派新穎</a><h1>246,000 元/月</h1><h1>坪數 :  123坪</h1>');
// L.marker([25.0586247, 121.6048596]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10331783.html">近南港捷運車站展覽館辦公</a><h1>211,000 元/月</h1><h1>坪數 :  140.39坪</h1>');
// L.marker([25.0602922, 121.6154827]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10478683.html">南港中信總部旁全新完工A級商辦</a><h1>988,000 元/月</h1><h1>坪數 :  495坪</h1>');
// L.marker([25.0501148, 121.5934548]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10429964.html">☆昆陽捷運一級辦公☆高樓俯視東區新門戶</a><h1>180,000 元/月</h1><h1>坪數 :  126坪</h1>');
// L.marker([25.0551892, 121.5892360]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10303358.html">新裝潢/24h管理/82坪辦公室</a><h1>100,000 元/月</h1><h1>坪數 :  82坪</h1>');
// L.marker([25.0585312, 121.6061037]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10271741.html">最優質企業總部交通便捷提升企業形象首選</a><h1>150,000 元/月</h1><h1>坪數 :  123.75坪</h1>');

// L.marker([25.053507, 121.6140897]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10396867.html">南港展覽館站一樓門口可停車</a><h1>30,000 元/月</h1><h1>坪數 :  25.74坪</h1>');
// L.marker([25.0614384, 121.6128123]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10616191.html">[風雲地產]-近南軟大空間優質辦公室</a><h1>32,000 元/月</h1><h1>坪數 :  34.02坪</h1>');
// L.marker([25.0456093, 121.6143284]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10648361.html">近中研院電梯雅靜辦公,優質環境,可住辦</a><h1>32,000 元/月</h1><h1>坪數 :  38.88坪</h1>');
// L.marker([25.0488676, 121.5852076]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10641252.html">辦公室分租!!!</a><h1>25,000 元/月</h1><h1>坪數 :  60坪</h1>');

// L.marker([25.039488, 121.591759]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10653497.html">文教區~近公園~市場~捷運</a><h1>33,000 元/月</h1><h1>坪數 :  25坪</h1>');
// L.marker([25.0456093, 121.6143284]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10648428.html">電梯大樓,戶數少,隨時入駐</a><h1>32,000 元/月</h1><h1>坪數 :  38.88坪</h1>');
// L.marker([25.0565063, 121.6033523]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10340017.html">南港近學校、捷運鬧中取靜的住辦好屋</a><h1>33,000 元/月</h1><h1>坪數 :  35坪</h1>');


// L.marker([25.0614384, 121.6128123]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10692167.html">[風雲地產]-近南軟大空間優質辦公室</a><h1>32,000 元/月</h1><h1>坪數 :  34.02坪</h1>');
// L.marker([25.049648, 121.5880864]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10682314.html">方正1樓明亮停車交通便利宜辦公辦住</a><h1>26,000 元/月</h1><h1>坪數 :  22.73坪</h1>');
// L.marker([25.0565111, 121.6014621]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10422813.html">@@南港捷運商圈旁*優質機能商辦</a><h1>40,000 元/月</h1><h1>坪數 :  46坪</h1>');
// L.marker([25.053507, 121.6140897]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10396867.html">南港展覽館站一樓門口可停車</a><h1>30,000 元/月</h1><h1>坪數 :  25.74坪</h1>');
// L.marker([25.0488676, 121.5852076]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10641252.html">辦公室分租!!!</a><h1>25,000 元/月</h1><h1>坪數 :  60坪</h1>');
// L.marker([25.0444565, 121.5835173]).addTo(map)
//     .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10622748.html">後山埤站2分鐘一樓住辦(門口可停車)</a><h1>40,000 元/月</h1><h1>坪數 :  29.17坪</h1>');

L.marker([25.0067894, 121.4616680]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-9899400.html">個人/共享辦公室輔導個人低成本創業</a><h1>3,500 元/月</h1><h1>坪數 :  30坪</h1>');
L.marker([25.02479, 121.460258]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10573775.html">新埔四維商圈辦公室，工作室出租，分租</a><h1>27,000 元/月</h1><h1>坪數 :  40坪</h1>');
L.marker([25.0067894, 121.4616680]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-9899400.html">個人/共享辦公室輔導個人低成本創業</a><h1>3,500 元/月</h1><h1>坪數 :  30坪</h1>');
L.marker([25.02479, 121.460258]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10573775.html">新埔四維商圈辦公室，工作室出租，分租</a><h1>27,000 元/月</h1><h1>坪數 :  40坪</h1>');
L.marker([25.0239735, 121.4802532]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10601347.html">華翠大橋旁二樓住辦-龍邑不動產</a><h1>30,000 元/月</h1><h1>坪數 :  53.12坪</h1>');
L.marker([25.0077379, 121.47178]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10588003.html">正漢生東路辦公可吊掛招牌顯眼</a><h1>27,000 元/月</h1><h1>坪數 :  29.9坪</h1>');
L.marker([25.008296, 121.453791]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10607460.html">府中站辦公三樓美寓~鄰巷口/好厝底!</a><h1>25,000 元/月</h1><h1>坪數 :  26.93坪</h1>');
L.marker([25.0062116, 121.4591826]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10698711.html">可營登!大坪數近府中捷運方正辦公</a><h1>25,000 元/月</h1><h1>坪數 :  34.35坪</h1>');
L.marker([25.0350259, 121.4715565]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10546194.html">採光佳適辦公網拍歡迎來電</a><h1>30,000 元/月</h1><h1>坪數 :  22坪</h1>');
L.marker([25.0137490, 121.4733210]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-6349061.html">板新環狀線旁出口走路3分鐘</a><h1>28,000 元/月</h1><h1>坪數 :  29坪</h1>');
L.marker([25.0083486, 121.4609716]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10546433.html">府中捷運五分鐘分租辦公室</a><h1>9,000 元/月</h1><h1>坪數 :  24.0911坪</h1>');
L.marker([25.0326662, 121.4801454]).addTo(map)
    .bindPopup('<a href="https://rent.591.com.tw/rent-detail-10439885.html">可供辦公室.工作室等使用</a><h1>30,000 元/月</h1><h1>坪數 :  42坪</h1>');

var myIcon = L.icon({
    iconUrl: 'Toicon-icon-avocado-locate.png',
    iconSize: [32, 32],
    iconAnchor: [16, 32],
    popupAnchor: [0, -40]

});

L.control.locate().addTo(map);